<template>
  <q-page class="flex flex-center">
    <p>
      Стеганографические методы давно известны и повсеместно применяются для
      сокрытия персональных данных, иногда они применяются для защиты авторского
      права. Сейчас стеганография используется в основном для обеспечения
      информационной безопасности. Однако, потенциал данных программных решений
      и методов раскрыт не в полной мере, так как существуют средства, которые
      эти методы обнаруживают.
    </p>
    <p>
      Целью данного исследования является разработка программно-математических
      средств, способных улучшить качество работы стеганографических методов
      сокрытия информации на основе оптимизации подбора их параметров, таким
      образом чтобы уже существующие методы могли использоваться лучше и
      получить более высокие показатели их работы.
    </p>
    <p>
      В качестве осинового метода выбран метод LSB. В работе рассмотрены пять
      основных методов, которые позволяют на основе особенностей работы метода
      LSB получить характеристики, которые обнаруживают стеганографически
      скрытую целевую информацию. Также в работе показаны пути борьбы с методами
      обнаружения стеганографической информации, за счет использования
      современных подходов в том числе и на основе методов машинного обучения и
      искусственного интеллекта.
    </p>
    <p>
      Таким образом, подводя итог, для повышения качества сокрытия информации с
      помощью алгоритмов стеганографии требуется учесть следующие особенности
      данных методов. Следует внедрять сообщение в случайные биты, то есть
      сделать его не похожим на то сообщение, которые могли бы обнаружить
      стандартные алгоритмы. Этого можно добиться, применив алгоритм
      дополнительного шифрования, например, алгоритм RSA справится с этой
      задачей. Уменьшать объем внедряемой информации, используя специальные
      средства визуализации LSB шума, что позволит подбирать точный размер
      криптоконтейнеров для конкретных изображений, но, к сожалению, явных
      закономерностей выявить не удалось. Использовать «плюс-минус» кодирование,
      это значит, что подбирается последовательность битов таким образом, чтобы
      изображение было асинхронным, то есть среднее значение внедряемых битов не
      должно колебаться около одной величины, чтобы повысить энтропию
      изображения и улучшить скрытность криптоконтейнера. Подбирать изображения
      с шумным LSB. К сожалению, не каждое изображение подходит для
      использования в стеганографии, поэтому предлагается ввести некоторую
      оценку самих изображений. В зависимости от энтропии LSB желательно
      подбирать те изображения, которые будут иметь определенный диапазон в
      одном характерном пространстве. Использовать оригинальные изображения, для
      которых получение оригинала для сравнения, изменено оно или же нет, не
      представляется возможным. Это могут быть коммерческие изображения или
      изображения из частных коллекций, которые не будут опубликованы в сети
      Интернет.
    </p>
  </q-page>
</template>

<script>
import { defineComponent } from "vue";

export default defineComponent({
  name: "IndexPage",
});
</script>
